#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_organizations_organization.root: Reading...
data.aws_organizations_organization.root: Read complete after 1s [id=o-i66z0agv26]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_organization.root will be created
  + resource "aws_organizations_organization" "root" {
      + accounts                      = (known after apply)
      + arn                           = (known after apply)
      + aws_service_access_principals = [
          + "account.amazonaws.com",
          + "cloudtrail.amazonaws.com",
          + "config.amazonaws.com",
          + "ram.amazonaws.com",
          + "ssm.amazonaws.com",
          + "tagpolicies.tag.amazonaws.com",
        ]
      + enabled_policy_types          = [
          + "SERVICE_CONTROL_POLICY",
          + "TAG_POLICY",
        ]
      + feature_set                   = "ALL"
      + id                            = (known after apply)
      + master_account_arn            = (known after apply)
      + master_account_email          = (known after apply)
      + master_account_id             = (known after apply)
      + non_master_accounts           = (known after apply)
      + roots                         = (known after apply)
    }

  # aws_organizations_organizational_unit.active["bu1"] will be created
  + resource "aws_organizations_organizational_unit" "active" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "bu1"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.active["bu2"] will be created
  + resource "aws_organizations_organizational_unit" "active" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "bu2"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.trash will be created
  + resource "aws_organizations_organizational_unit" "trash" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "trash"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_policy.bca will be created
  + resource "aws_organizations_policy" "bca" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "config:DeleteConfigRule",
                          + "config:DeleteConfigurationRecorder",
                          + "config:DeleteDeliveryChannel",
                          + "config:StopConfigurationRecorder",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Block AWS Config Actions"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.bcca will be created
  + resource "aws_organizations_policy" "bcca" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudtrail:AddTags",
                          + "cloudtrail:CreateTrail",
                          + "cloudtrail:DeleteTrail",
                          + "cloudtrail:RemoveTags",
                          + "cloudtrail:StartLogging",
                          + "cloudtrail:StopLogging",
                          + "cloudtrail:UpdateTrail",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "Stmt1234567890123"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Block CloudTrail Configuration Actions"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.dsous will be created
  + resource "aws_organizations_policy" "dsous" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Condition = {
                          + StringNotEquals = {
                              + "aws:RequestedRegion" = [
                                  + "af-*",
                                  + "ap-*",
                                  + "ca-*",
                                  + "eu-*",
                                  + "me-*",
                                  + "sa-*",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + NotAction = [
                          + "a4b:*",
                          + "acm:*",
                          + "aws-marketplace-management:*",
                          + "aws-marketplace:*",
                          + "aws-portal:*",
                          + "budgets:*",
                          + "ce:*",
                          + "chime:*",
                          + "cloudfront:*",
                          + "config:*",
                          + "cur:*",
                          + "directconnect:*",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeTransitGateways",
                          + "ec2:DescribeVpnGateways",
                          + "fms:*",
                          + "globalaccelerator:*",
                          + "health:*",
                          + "iam:*",
                          + "importexport:*",
                          + "kms:*",
                          + "mobileanalytics:*",
                          + "networkmanager:*",
                          + "organizations:*",
                          + "pricing:*",
                          + "route53:*",
                          + "route53domains:*",
                          + "s3:GetAccountPublic*",
                          + "s3:ListAllMyBuckets",
                          + "s3:PutAccountPublic*",
                          + "shield:*",
                          + "sts:*",
                          + "support:*",
                          + "trustedadvisor:*",
                          + "waf-regional:*",
                          + "waf:*",
                          + "wafv2:*",
                          + "wellarchitected:*",
                        ]
                      + Resource  = "*"
                      + Sid       = "DenyAllOutsideUS"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Deny Services Outside US"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.pesr will be created
  + resource "aws_organizations_policy" "pesr" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ram:CreateResourceShare",
                          + "ram:UpdateResourceShare",
                        ]
                      + Condition = {
                          + Bool = {
                              + "ram:RequestedAllowsExternalPrincipals" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Preventing External Sharing of Resources"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.tmp will be created
  + resource "aws_organizations_policy" "tmp" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "organizations:ListPoliciesForTarget",
                          + "organizations:ListTargetsForPolicy",
                          + "organizations:DescribeEffectivePolicy",
                          + "organizations:DescribePolicy",
                          + "organizations:ListRoots",
                          + "organizations:DisableAWSServiceAccess",
                          + "organizations:DetachPolicy",
                          + "organizations:DeletePolicy",
                          + "organizations:DescribeAccount",
                          + "organizations:DisablePolicyType",
                          + "organizations:ListAWSServiceAccessForOrganization",
                          + "organizations:ListPolicies",
                          + "organizations:ListAccountsForParent",
                          + "organizations:ListAccounts",
                          + "organizations:EnableAWSServiceAccess",
                          + "organizations:ListCreateAccountStatus",
                          + "organizations:DescribeOrganization",
                          + "organizations:UpdatePolicy",
                          + "organizations:EnablePolicyType",
                          + "organizations:DescribeOrganizationalUnit",
                          + "organizations:AttachPolicy",
                          + "organizations:ListParents",
                          + "organizations:ListOrganizationalUnitsForParent",
                          + "organizations:CreatePolicy",
                          + "organizations:DescribeCreateAccountStatus",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageTagPolicies"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Tag Management Policy"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.bca will be created
  + resource "aws_organizations_policy_attachment" "bca" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = (known after apply)
    }

  # aws_organizations_policy_attachment.bcca will be created
  + resource "aws_organizations_policy_attachment" "bcca" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = (known after apply)
    }

  # aws_organizations_policy_attachment.dsous will be created
  + resource "aws_organizations_policy_attachment" "dsous" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = (known after apply)
    }

  # aws_organizations_policy_attachment.root will be created
  + resource "aws_organizations_policy_attachment" "root" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = (known after apply)
    }

  # aws_organizations_policy_attachment.tmp will be created
  + resource "aws_organizations_policy_attachment" "tmp" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + non_root_accounts = {
      + aws-lab-dev-acct = {
          + arn    = "arn:aws:organizations::543863199176:account/o-i66z0agv26/569994124624"
          + id     = "569994124624"
          + status = "SUSPENDED"
        }
      + test-prd         = {
          + arn    = "arn:aws:organizations::543863199176:account/o-i66z0agv26/108356685508"
          + id     = "108356685508"
          + status = "SUSPENDED"
        }
      + test-prod        = {
          + arn    = "arn:aws:organizations::543863199176:account/o-i66z0agv26/822275142151"
          + id     = "822275142151"
          + status = "SUSPENDED"
        }
      + test-stag        = {
          + arn    = "arn:aws:organizations::543863199176:account/o-i66z0agv26/743070730264"
          + id     = "743070730264"
          + status = "SUSPENDED"
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ricardo-f, Action: `pull_request`, Working Directory: ``, Workflow: `Account Creation`*